<?php
/**
 * Украинский языковой пакет для Joostina CMS 1.3.0.4
 * Основан на коде оригинального языкового пакета от Joostina team
 * @package Joostina
 * @author Hnat Kubov
 * @authoremail hnatt88@gmail.com
 * @version 1.3.0.4-0.1
 * @copyright © 2011 Hnat Kubov
 * @license http://www.gnu.org/licenses/gpl-2.0.htm GNU/GPL
 */

// запрет прямого доступа
defined('_VALID_MOS') or die();

/** registration*/
DEFINE('_ERROR_PASSWORD', 'Вибачте, такий користувач не знайдений.');
DEFINE('_NEWPASS_MSG', 'реєстрація користувача $checkusername відповідає адресі e-mail.\n'.
	'Користувач сайту $config->config_live_site зробив запит на отримання нового пароля.\n\n'.
	'Ваш новий пароль: $newpass \n\nЯкщо ви не замовляли зміну пароля, повідомте про це адміністратора.'.
	'Тільки Ви можете побачити це повідомлення, більше ніхто. Якщо це помилка, просто зайдіть '.
	'на сайт, використовуючи новий пароль, і потім змініть його на зручний Вам.');
DEFINE('_NEWPASS_SUB', '$config->config_sitename :: Новий пароль для $checkusername');
DEFINE('_NEWPASS_SENT', 'Новий пароль створений і відправлений користувачеві!');
DEFINE('_REGWARN_NAME', 'Будь ласка, введіть своє справжнє ім’я (ім’я, що відображається на сайті).');
DEFINE('_REGWARN_USERNAME', 'Будь ласка, введіть своє ім’я користувача (логін).');
DEFINE('_REGWARN_PASSWORD', 'Будь ласка, правильно введіть пароль. Пароль не повинен містити пробіли, його довжина повинна бути не менше 6 символів і він повинен складатися тільки з цифр (0-9) і латинських символів (a-z, A-Z)');
DEFINE('_REGWARN_VPASS1', 'Будь ласка, перевірте пароль.');
DEFINE('_REGWARN_VPASS2', 'Пароль та його підтвердження не співпадають. Будь ласка, спробуйте ще раз.');
DEFINE('_SEND_SUB', 'Дані про нового користувача %s з %s');
DEFINE('_USEND_MSG_ACTIVATE', 'Доброго дня, %s,

Дякуємо за реєстрацію на сайті %s. Ваш обліковий запис успішно створений і повинен бути активований.
Щоб активувати обліковий запис, натисніть на посиланні або скопіюйте його в адресний рядок браузера:
%s

Після активації Ви можете зайти на сайт %s, використовуючи своє ім’я користувача та пароль:

Ім’я користувача - %s
Пароль - %s ');
DEFINE('_USEND_MSG', "Доброго дня, %s,

Дякуємо Вам за реєстрацію на сайті %s.

Зараз ви можете увійти на сайт %s, використовуючи ім’я користувача та пароль, які ви ввели при реєстрації. ");
DEFINE('_USEND_MSG_NOPASS', 'Доброго дня $name,\n\nВи успішно зареєстровані на сайті $mosConfig_live_site. \n'.
	'Ви можете зайти на сайт $mosConfig_live_site, використовуючи дані, які Ви вказали при реєстрації. \n\n'.
	'На цей лист не треба відповідати, оскільки він створений автоматично і призначений тільки для сповіщення \n');
DEFINE('_ASEND_MSG', 'Доброго дня! Це системне повідомлення з сайту %s.

На сайті %s зареєструвався новий користувач.

Дані користувача:
Справжнє ім’я - %s
Адреса e-mail - %s
Ім’я користувача - %s

На цей лист не треба відповідати, так як він створений автоматично і призначений тільки для сповіщення ');
DEFINE('_REG_COMPLETE_NOPASS', '<div class="componentheading">Реєстрація завершена!</div> <br />Зараз Ви можете увійти на сайт.') ;
DEFINE('_REG_COMPLETE', '<div class="componentheading">Реєстрація завершена!</div><br />Зараз ви можете увійти на сайт.');
DEFINE('_REG_COMPLETE_ACTIVATE', '<div class="componentheading">Реєстрація завершена!</div><br />Ваш обліковий запис створений і повинен бути активований перед тим, як ви ним скористаєтеся. На Ваш e-mail було відправлено листа з посиланням, за допомогою якого Ви можете активувати свій обліковий запис. ');
DEFINE('_REG_ACTIVATE_COMPLETE', '<div class="componentheading">Обліковий запис активовано!</div><br />Ваш обліковий запис активовано. Тепер Ви можете зайти на сайт, використовуючи ім’я користувача та пароль, які Ви вибрали під час реєстрації.');
DEFINE('_REG_ACTIVATE_NOT_FOUND', '<div class="componentheading">Невірне посилання активації!</div><br />Даний профіль відсутній на сайті або вже активований.');
DEFINE('_REG_ACTIVATE_FAILURE', '<div class="componentheading">Помилка активації!</div><br />Активація облікового запису неможлива. Будь ласка, зверніться до адміністратора.');
DEFINE('_USER_ACTIVATION_FAILED', '<div class="componentheading">Помилка активації!</div><br />Активація облікового запису неможлива. Будь ласка, зверніться до адміністрації сайту');
DEFINE('_NEW_PASSWORD_DESC', 'Будь ласка, введіть свої ім’я користувача та адресу e-mail, потім натисніть кнопку "Надіслати пароль".<br />Через деякий час на адресу e-mail Ви отримаєте лист з новим паролем. Використовуйте цей пароль для входу на сайт. ');
DEFINE('_PROMPT_USERNAME', 'Ім’я користувача:');
DEFINE('_PROMPT_EMAIL', 'Адреса e-mail:');
DEFINE('_BUTTON_SEND_PASSWORD', 'Надіслати пароль');
DEFINE('_REGISTER_TITLE', 'Реєстрація');
DEFINE('_REGISTER_NAME', 'Справжнє ім’я:');
DEFINE('_REGISTER_USERNAME', 'Ім’я користувача:');
DEFINE('_REGISTER_EMAIL', 'E-mail:');
DEFINE('_REGISTER_PASSWORD', 'Пароль:');
DEFINE('_REGISTER_VPASS', 'Підтвердження паролю:');
DEFINE('_BUTTON_SEND_REG', 'Надіслати дані');
DEFINE('_SENDING_PASSWORDWORD', 'Ваш пароль буде надісланий на зазначену вище адресу e-mail.<br />Коли Ви отримаєте новий пароль, Ви зможете зайти на сайт і змінити цей пароль в будь-який час.');
DEFINE('_VALID_AZ09', "Будь ласка, перевірте, чи правильно написано %s. Ім’я не повинно містити пробілів, тільки символи 0-9, a-z, A-Z і мати довжину не менше %d символів.");
DEFINE('_VALID_AZ09_USER', "Будь ласка, правильно введіть %s. Має містити тільки символи 0-9, a-z, A-Z і мати довжину не менше %d символів.");
/** User **/
DEFINE('_SAVE_ERR', 'Будь ласка, заповніть всі поля.');
DEFINE('_THANK_SUB_PUB', 'Дякуємо за Ваш матеріал.');
DEFINE('_UP_SIZE', 'Ви не можете завантажувати файли розміром більше ніж 15Кб.');
DEFINE('_UP_EXISTS', 'Зображення з іменем $userfile_name вже існує. Будь ласка, змініть назву файлу та спробуйте ще раз.');
DEFINE('_UP_COPY_FAIL', 'Помилка при копіюванні');
DEFINE('_UP_TYPE_WARN', 'Ви можете завантажувати зображення тільки у форматі gif або jpg.');
DEFINE('_PASSWORD_VERR1', 'Якщо Ви бажаєте змінити пароль, будь ласка, введіть його ще раз для підтвердження зміни.');
DEFINE('_PASSWORD_VERR2', 'Якщо Ви вирішили змінити пароль, будь ласка, зверніть увагу, що пароль і його підтвердження повинні співпадати.');
DEFINE('_USERNAME_INUSE', 'Обране ім’я користувача вже існує.');
DEFINE('_UPDATE', 'Оновити');
DEFINE('_USER_DETAILS_SAVE', 'Ваші дані збережено.');
DEFINE('_USER_LOGIN', 'Вхід користувача');
DEFINE('_USER_PERSONAL_DATA', 'Особисті дані');
DEFINE('_YOUR_NAME', 'Повне ім’я');
DEFINE('_VPASS', 'Підтвердження пароля');
DEFINE('_SUBMIT_SUCCESS', 'Ваша інформація була прийнята!');
DEFINE('_SUBMIT_SUCCESS_DESC', 'Ваша інформація успішно надіслана адміністратору. Після перегляду Ваш матеріал буде опубліковано на цьому сайті');
DEFINE('_WELCOME', 'Ласкаво просимо!');
DEFINE('_WELCOME_DESC', 'Ласкаво просимо до розділу користувача нашого сайту');
DEFINE('_CONF_CHECKED_IN', "Всі 'заблоковані' Вами елементи тепер 'розблоковані'.");
DEFINE('_CHECK_TABLE', 'Перевірка таблиці');
DEFINE('_CHECKED_IN', 'Перевірено ');
DEFINE('_PASSWORD_MATCH', 'Паролі не співпадають');
DEFINE('_SITE_SETTINGS', 'Параметри сайту');
DEFINE('_SELECT_EDITOR', '- Виберіть редактор -');
DEFINE('_USER_NOT_FOUND', 'Вибачте, користувач не знайдений');
DEFINE('_WAIT_ACTIVATION', 'Дякуємо за реєстрацію. Доступ до облікового запису буде надано після перевірки модератором.');
DEFINE('_USER_LAST_VISIT', 'Останній візит');
DEFINE('_USER_EDIT_PROFILE', 'Редагувати профіль');
DEFINE('_USER_ON_LINE', 'на сайті');
DEFINE('_USER_OFF_LINE', 'відсутній');

DEFINE('_USER_PROFILE_INFO', 'Дані профілю');
DEFINE('_USER_CONTENTS', 'Публікації');