<?php
/**
 * Украинский языковой пакет для Joostina CMS 1.3.0.4
 * Основан на коде оригинального языкового пакета от Joostina team
 * @package Joostina
 * @author Hnat Kubov
 * @authoremail hnatt88@gmail.com
 * @version 1.3.0.4-0.1
 * @copyright © 2011 Hnat Kubov
 * @license http://www.gnu.org/licenses/gpl-2.0.htm GNU/GPL
 */

// запрет прямого доступа
defined('_VALID_MOS') or die();

$search_ignore[] = "в";
$search_ignore[] = "на";
$search_ignore[] = "і";
$search_ignore[] = "або";
$search_ignore[] = "про";
$search_ignore[] = "чи";
$search_ignore[] = "під";
$search_ignore[] = "по";
$bad_text = array( ' авле ', ' без ', ' більше ', ' був ', ' була ', ' були ',
	' було ', ' бути ', ' вам ', ' вас ', ' вгору ', ' видно ', ' от ', 
	' ось ', ' завжди ', ' всіх ', ' де ', ' говорила ', ' говорим ',
	' говорить ', ' навіть ', ' два ', ' для ', ' його ', ' йому ', ' якщо ',
	' є ', ' ще ', ' потім ', ' тут ', ' знала ', ' знаю ', ' йду ', ' або ',
	' кожен ', ' здається ', ' здавалось ', ' як ', ' які ', ' коли ', 
	' котре ', ' котрі ', ' хто ', ' мене ', ' мені ', ' міг ', ' могла ', 
	' можу ', ' моє ', ' моєю ', ' може ', ' можна ', ' мої ', ' мій ',
	' мовляв ', ' моя ', ' треба ', ' нас ', ' почав ', ' почала ', ' неї ', 
	' ній ', ' трохи ', ' трішки ', ' ньому ', ' декілька ', ' немає ',
	' ніколи ', ' них ', ' нічого ', ' однак ', ' вона ', ' вони ', ' воно ' ,
	' знову ', ' дуже ', ' під ', ' поки ', ' після ', ' потім ', ' майже ',
	' при ', ' про ', ' раз ', ' своїй ', ' свій ', ' свою ', ' собі ',
	' себе ', ' зараз ', ' сказав ', ' сказала ', ' злегка ', ' надто ',
	' наче ', ' знова ', ' став ', ' стала ', ' стали ', ' так ', ' там ', 
	' твої ', ' твоя ', ' тобі ', ' тебе ', ' тепер ', ' тоді ', ' того ', 
	' теж ', ' тільки ', ' три ', ' тут ', ' уже ', ' хоча ', ' ніж ', 
	' через ', ' що ' , ' щоб ', ' трохи ', ' ця ', ' ці ', ' цих ', ' це ', 
	' цього ', ' цією ', ' цьому ', ' цю ' );